Merge pull request #26 from SadDevastator/docs/mermaid-diagrams
